// Напишите программу , которая на вход принимает число и выдаёт его квадрат
Console.WriteLine("Введите ваше число");
int a = Convert.ToInt32(Console.ReadLine());
int square = (a*a);
Console.Write(" квадрат вашего числа равен = ");//($"Квадрат числа {number} -> {square}");
Console.WriteLine(square);
